IDEA Open Model
Element1D.RotationRx Property
Compatible with IDEA StatiCa Beta 20.0
 Rotation of Cross-section of Element1D. Difference from default Line LCS
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public double RotationRx { get; set; }
Public Property RotationRx As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace